tutorials/fluid/hotRoomBoussinesq/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    T   300;
}

zones
{
    hotFaces
    {
        type        box;
        zoneType    face;

        box         (4.5 -1000 4.5) (5.5 1e-5 5.5);

        values
        {
            T   600;
        }
    }
}

// ************************************************************************* //
